FKDD_COPY_DIFF_3_2026-02-14/Enums/ACPM_Портал.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ACPM_Портал</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>FORD</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УАЗ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/CommonModules/АСРМ_ПодпискиНаСобытия/Ext/Module.bsl
Процедура АСРМ_DSFСервис_ПриЗаписиЗаказНарядаОтправкаИзмененийОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	РодительМодели = ТТ_Общий.ПолучитьБрэнд(Источник.Автомобиль.Модель);
	Если Найти(РодительМодели, "FORD")>0 тогда
		Если обПраво("АвтодилерВыгрузкаВCRM_FORD") Тогда
			УспешноОтправлен=АСРМ_DSFСервис_ПротоколПодключения.ПередатьЗаказНаряд(Источник.Ссылка, Перечисления.ACPM_Портал.FORD);
			Если НЕ УспешноОтправлен Тогда
				Сообщить("Произошла ошибка при отправке заказ наряда в DSF. Попробуйте отправить его позже " + Строка(ТекущаяДата()));
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли   Найти(РодительМодели, "UAZ")>0 или Найти(РодительМодели, "УАЗ")  тогда
		Если обПраво("АвтодилерВыгрузкаВCRM_УАЗ") Тогда
			УспешноОтправлен=АСРМ_DSFСервис_ПротоколПодключения.ПередатьЗаказНаряд(Источник.Ссылка, Перечисления.ACPM_Портал.УАЗ);
			Если НЕ УспешноОтправлен Тогда
				Сообщить("Произошла ошибка при отправке заказ наряда в DSF. Попробуйте отправить его позже " + Строка(ТекущаяДата()));
			КонецЕсли;
		КонецЕсли;

	КонецЕсли;
КонецПроцедуры
